blog/augment-emacs-with-zoxide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-16 Sat 09:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Augmenting Emacs With ZOxide For Efficient File System Navigation</title>
<meta name="author" content="T.V Raman" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Augmenting Emacs With ZOxide For Efficient File System Navigation</h1>
<div id="outline-container-orgd598038" class="outline-2">
<h2 id="orgd598038"><span class="section-number-2">1.</span> Background</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacs has no shortage of multiple built-in means of navigating the
file system with smart, context-sensitive and fuzzy completion.  That
said, there is one tool outside Emacs  I have discovered in the last six
months that brings something extra &#x2014; <a href="https://github.com/ajeetdsouza/zoxide">Zoxide</a>, a smarter <span class="underline">cd</span> built in
Rust.
</p>
</div>
</div>

<div id="outline-container-org72a30ff" class="outline-2">
<h2 id="org72a30ff"><span class="section-number-2">2.</span> Default Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
Once installed, <span class="underline">zoxide</span> works well in Emacs shells, as well as at
terminals inside or outside Emacs. Read the <span class="underline">zoxide</span> docs for more
details, but in a nutshell, this tool remembers directories you  work
in, and lets you jump to them by typing short, unique substrings.
</p>
</div>
</div>

<div id="outline-container-orgbf8abf6" class="outline-2">
<h2 id="orgbf8abf6"><span class="section-number-2">3.</span> Working In Emacs</h2>
<div class="outline-text-2" id="text-3">
<p>
So with <span class="underline">zoxide</span> installed, you can:
</p>

<ol class="org-ol">
<li>Switch to a shell buffer,</li>
<li>Execute a <span class="underline">zoxide</span> navigation command, e.g., <span class="underline">z &lt;pattern&gt;</span>.</li>
<li><p>
Once there, you can easily open files, launch <span class="underline">dired</span> etc.
</p>

<p>
But given that opening <span class="underline">dired</span> on that target is what I often
want, the above work-flow still involved two steps too many. So
in typical Emacs fashion, I wrote a short function that
short-circuits this process
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgc58cf4f" class="outline-2">
<h2 id="orgc58cf4f"><span class="section-number-2">4.</span> Command: <code>emacspeak-zoxide</code></h2>
<div class="outline-text-2" id="text-4">
<p>
Note: there is nothing emacspeak specific in what follows.
</p>


<ol class="org-ol">
<li>Interactive command <a href="https://github.com/tvraman/emacspeak/blob/master/lisp/emacspeak-wizards.el#start-of-content">emacspeak-zoxide</a> prompts for a pattern,
then launches <code>dired</code> on the <span class="underline">zoxide</span> result.</li>
<li>It uses <code>if-let</code>  to  advantage:
<ul class="org-ul">
<li>If  <span class="underline">zoxide</span> is installed,and</li>
<li>There is a <span class="underline">zoxide</span> result for the specified query,</li>
<li>Launch <code>dired</code> on that directory.</li>
<li>Else, signal the appropriate error.</li>
<li>Notice that <code>if-let</code> expresses this clearly.</li>
</ul></li>
</ol>

<div class="org-src-container">
<pre class="src src-emacs-list">(defun emacspeak-zoxide (q)
  "Query zoxide  and launch dired.
Shell Utility zoxide --- implemented in Rust --- lets you jump to
directories that are used often.
This command does for Emacs, what zoxide does at the  shell."
  (interactive "sZoxide:")
  (if-let
      ((zoxide (executable-find "zoxide"))
       (target
        (with-temp-buffer
          (if (= 0 (call-process zoxide nil t nil "query" q))
              (string-trim (buffer-string))))))
      (funcall-interactively #'dired  target)
    (unless zoxide (error "Install zoxide"))
    (unless target (error "No Match"))))
</pre>
</div>

<p>
In my setup, i bind this  to <span class="underline">C-; j</span> which is 
convenient  to press and is a mnemonic for <code>jump</code>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-09-16 Sat 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2023-09-16 Sat 09:50</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>